# Pandas Basics

In [4]:
import numpy as np
import pandas as pd

In [5]:
# Series is a 1-d array
h = ('AA', 123, '2019-11-09', 10.2)

S = pd.Series(h)

In [6]:
type(S)

pandas.core.series.Series

In [7]:
print(S)

0            AA
1           123
2    2019-11-09
3          10.2
dtype: object

In [8]:
# Converting dict to series
dict1 = {"Name": "kiruthika", "Age": 25, "occupation": "Data scientist"}
S1 = pd.Series(dict1)
print(S1)

Name               kiruthika
Age                       25
occupation    Data scientist
dtype: object

In [9]:
# COnvert array to series and give column name
a = ['AA', 123, '2019-11-09', 10.2]
s1 = pd.Series(a, index = ['a', 'b', 'c', 'd'])

In [10]:
print(s1)

a            AA
b           123
c    2019-11-09
d          10.2
dtype: object

In [11]:
s1[0]

'AA'

In [12]:
s1['b']

123

In [13]:
s1[['a', 'c']]

a            AA
c    2019-11-09
dtype: object

In [14]:
s1[0:2]

a     AA
b    123
dtype: object

In [17]:
data = {'name': ['Amy', 'Brenton', 'Cathy', 'Danny', 'Liza'],
       'age': [23,24,25,26, 25],
       'sex': ['F', 'M', 'F', 'M', 'F'],
       'share': [20,30,20,15,15]}

In [18]:
df = pd.DataFrame(data)

In [24]:
df

         age sex  share    owner
name
Amy       23   F     20  unknown
Brenton   24   M     30  unknown
Cathy     25   F     20  unknown
Danny     26   M     15  unknown
Liza      25   F     15  unknown

In [20]:
df['owner'] = 'unknown'

In [21]:
df.index = ['one', 'two', 'three', 'four', 'five']

In [23]:
df.set_index(['name'], inplace = True)

In [26]:
df.age

name
Amy        23
Brenton    24
Cathy      25
Danny      26
Liza       25
Name: age, dtype: int64

In [28]:
df.loc['Amy']

age           23
sex            F
share         20
owner    unknown
Name: Amy, dtype: object

In [29]:
df.loc[:, 'age']

name
Amy        23
Brenton    24
Cathy      25
Danny      26
Liza       25
Name: age, dtype: int64

In [30]:
df.age.iloc[0]

23

In [32]:
del df['owner']

In [33]:
df

         age sex  share
name
Amy       23   F     20
Brenton   24   M     30
Cathy     25   F     20
Danny     26   M     15
Liza      25   F     15

In [34]:
df.drop(['sex'], axis = 1)

         age  share
name
Amy       23     20
Brenton   24     30
Cathy     25     20
Danny     26     15
Liza      25     15

In [7]:
from collections import OrderedDict
st = 'python is not great than java but python is great that it'
st = st.split()
c = OrderedDict.fromkeys(st, 0)

for i in range(0, len(st)):
    print(c[st[i]])

0
0
0
0
0
0
0
0
0
0
0
0